package com.example.finaleprojectmodule3.game;

public class TextConstants {
    static final String MESSAGE = "Вы приходите в себя в небольшой каюте своего космического корабля и осознаете, " +
            "что ваше судно повреждено и приземлилось на нужной планете. Что вы сделаете?";
    static final String CHOICE1 = "Попробовать выйти из корабля и исследовать местность в поисках помощи или ресурсов.";
    static final String CHOICE2 = "Попытаться активировать корабельные системы " +
            "и попробовать связаться с кем-либо из своего экипажа или базой на другой планете.";


    // 1. Выходим исследовать мир.
    static final String MESSAGE1 = "Вы решаете выйти из корабля и исследовать местность. Поднимаетесь из каюты и открываете дверь корабля.\n\nВас окружает удивительный пейзаж: мягкий свет смешивается с нежными оттенками фиолетовых облаков. Вы стоите на небольшом холме и видите, что вдали простирается лес, состоящий из странных и сверкающих деревьев.";
    static final String CHOICE1_1 = "Отправиться в лес и исследовать его, надеясь найти подсказки о починке корабля.";
    static final String CHOICE1_2 = "Вернуться обратно в корабль, чтобы попробовать активировать системы связи или найти другие способы связи с внешним миром."; // MESSAGE2

    // 1.1 Отправляемся в лес.
    static final String MESSAGE1_1 = "Вы отправляетесь в лес, чтобы исследовать его и, возможно, найти подсказки, которые помогут вам в починке корабля. Шаг за шагом, вы вглубь леса, изучая странные сверкающие деревья и необычную растительность.\n\nЧем вы хотели бы заняться, исследуя этот загадочный лес?";
    static final String CHOICE1_1_1 = "Пройтись вдоль ручья, который течет вглубь леса, чтобы найти, откуда он исходит, и, возможно, найти какие-то необычные источники воды."; // Смерть.
    static final String CHOICE1_1_2 = "Попытаться разгадать какие-либо странные звуки, которые доносятся из глубины леса, чтобы понять, что скрывается в этой местности.";
    static final String CHOICE1_1_3 = "Продолжить идти глубже в лес, в поисках высокой точки, с которой можно получить обзор на окружающий ландшафт и, возможно, увидеть что-то интересное.";


    // 1.1.1 Идем вдоль ручья.
    static final String MESSAGE1_1_1 = "Вы решаете пройтись вдоль ручья, который течет вглубь леса, чтобы найти его исток. По мере продвижения, лес становится все более плотным и загадочным.\n\nПо мере вашего движения вглубь леса, вы неожиданно натыкаетесь на глубокую яму, скрытую под листвой и ветками. Ваше тело падает вниз, и вы чувствуете, как что-то острое пронзает вас. Вы внезапно теряете сознание.\n\nС тяжелыми повреждениями и без возможности получить медицинскую помощь, ваше приключение на планете Небесная Эклипса завершается здесь.";


    // 1.1.2 Ищем источник звука.
    static final String MESSAGE1_1_2 = "Вы решаете попробовать разгадать странные звуки, которые доносятся из глубины леса. Вы сосредотачиваетесь и внимательно слушаете, пытаясь понять, что скрывается за этими звуками.\n\nС каждой секундой звуки становятся все более интригующими. Вы приближаетесь к источнику, и вдруг, из густых зарослей, появляется странное существо с пылающими голубыми глазами и множеством антенн. Оно издает гудящие звуки и начинает приближаться к вам.";
    static final String CHOICE1_1_2_1 = "Залезть на дерево в надежде, что зверь вас не достанет.";
    static final String CHOICE1_1_2_2 = "Попытаться отпугнуть зверя, используя свой инструмент или какой-либо предмет из вашего снаряжения"; // Смерть.

    // 1.1.2.1 Залезть на дерево от зверя.
    static final String MESSAGE1_1_2_1 = "Вы решаете действовать быстро и, видя, что зверь приближается, забираетесь на ближайшее дерево. Ваши руки дрожат, но вы удается забраться выше, недоступно для зверя.\n\nВы сидите на дереве в тишине, надеясь, что зверь уйдет. Однако, после некоторого времени, когда уже кажется, что опасность миновала, вы вдруг слышите странные звуки. На вашем поле зрения появляется инопланетянин, несмотря на то, что на планете не было видно никаких признаков разумной жизни.\n\nИнопланетянин приближается к дереву, на котором вы находитесь, и начинает издавать странные и неразборчивые звуки. Он имеет высокий и стройный стан, его тело покрыто гладкой, переливающейся, синеватой кожей. На его голове находится множество антенн, которые медленно двигаются, словно антенны насекомого.\n\nГлаза инопланетянина крупные, округлые и голубого цвета, они сверкают мягким светом, и кажется, будто в них заложены невероятные знания и мудрость. Его конечности оканчиваются странными трехпальцевыми руками, способными выполнять сложные движения.\n\nОдежда инопланетянина напоминает легкий плащ из необычного материала, который также переливается разноцветными оттенками при движении. В целом, его внешний вид поражает своей экзотичностью и непохожестью на человеческие формы жизни.\n\nКак вы реагируете на прибытие инопланетянина?";
    static final String CHOICE1_1_2_1_1 = "Вы сидите на дереве, ощущая угрозу от инопланетянина и приготавливаетесь к возможной атаке, готовя свой инструмент для самозащиты.";
    static final String CHOICE1_1_2_1_2 = "Вы решаете активно взаимодействовать с инопланетянином, спускаясь с дерева и показывая свою миролюбивость, надеясь на позитивное взаимодействие."; // Смерть.

    // 1.1.2.1.1 Готовимся к атаке.
    static final String MESSAGE1_1_2_1_1 = "Вы сидите на дереве, готовясь к возможной атаке от инопланетянина. Однако, вместо агрессии, инопланетянин начинает устанавливать телепатическую связь с вами. С его помощью он передает вам образы и эмоции, демонстрируя свою дружелюбность и намерение помочь.\n\nИнопланетянин приглашает вас спуститься с дерева и следовать за ним.";
    static final String CHOICE1_1_2_1_1_1 = "Вы не доверяете инопланетянину и пытаетесь сбежать."; // Смерть.
    static final String CHOICE1_1_2_1_1_2 = "Принять помощь инопланетянина и следовать за ним.";

    // 1.1.2.1.1.1 Пытаемся сбежать от инопланетянина.
    static final String MESSAGE1_1_2_1_1_1 = "Вы решаете не доверять инопланетянину и попытаться сбежать, чтобы избежать любых потенциальных угроз. Вы начинаете спускаться с дерева и беззвучно перемещаться в противоположном направлении. Однако, внезапно, вы слышите рычание зверя, который вскоре атакует вас.\n\nЗверь сбрасывает вас с ног, и вы оказываетесь беззащитным перед его агрессией. Ваше приключение на планете Небесная Эклипса завершается смертью от нападения зверя.";

    // 1.1.2.1.1.2 Принимаем помощь инопланетянина.
    static final String MESSAGE1_1_2_1_1_2 = "Вы решаете принять помощь инопланетянина и спуститься с дерева. Он приветствует вас и начинает вести вас сквозь густой лес.По мере вашего продвижения, вы оказываетесь перед величественными руинами, которые свидетельствуют о некогда цветущей цивилизации инопланетян.\n\nРуины древнего города представляют собой впечатляющий и таинственный пейзаж. Город был построен с учетом необычных архитектурных форм и материалов, которые вы никогда не видели ранее. Окруженный густой растительностью и чудесными светящимися деревьями, город оставляет впечатление невероятной гармонии с окружающей природой.\n\nЗдания города были построены из сверкающих камней, которые, кажется, излучают свет в темноте. Вы видите руины многочисленных башен, пирамид и домов, остатки некогда развитой цивилизации. Здания украшены сложными рельефами и символами, которые остались загадкой для вас.\n\nИнопланетянин рассказывает вам о истории своего народа и обитателях планеты Небесная Эклипса.";
    static final String CHOICE1_1_2_1_1_2_1 = "Слушать историю."; // MESSAGE1_1_3_2_2_1_1_1

    // 1.1.2.1.2 Начинаем активно взаимодействовать с инопланетянином.
    static final String MESSAGE1_1_2_1_2 = "Вы решаете активно взаимодействовать с инопланетянином, спускаясь с дерева и показывая свою миролюбивость. Однако, инопланетянин начинает воспринимать ваши действия как угрозу, и его антенны начинают вибрировать странно. Внезапно он выпускает мощный энергетический импульс, который оказывается смертельным для вас.\n\nВаши намерения были дружелюбными, но в данной ситуации инопланетянин воспринял вас как угрозу, и ваше приключение на планете Небесная Эклипса завершается смертью от его реакции на вас.";

    // 1.1.2.2 Пытаемся отпугнуть зверя.
    static final String MESSAGE1_1_2_2 = "Вы решаете попытаться отпугнуть зверя, используя свой инструмент. Вы поднимаете инструмент и пытаетесь отразить атаку зверя, но он оказывается слишком сильным и быстрым. Зверь наносит вам смертельное ранение, и ваше приключение на планете Небесная Эклипса заканчивается здесь.";


    // 1.1.3 Идем глубже в лес.
    static final String MESSAGE1_1_3 = "Вы продолжаете идти глубже в лес, в поисках высокой точки, с которой можно получить обзор на окружающий ландшафт. После некоторого времени ваши ступни выходят на открытое место, и вы оказываетесь на вершине небольшого холма.\n\nС этой высокой точки, вы наконец можете увидеть что-то интересное. Вдали, сквозь густую листву, вы разглядываете мерцающие светлые структуры, напоминающие руины древнего города. Эти руины привлекают ваше внимание и внушают ощущение загадки и тайны.\n\nСкоро наступит ночь и у вас есть выбор:";
    static final String CHOICE1_1_3_1 = "Спустится к руинам напрямую, до наступления темноты."; // Смерть.
    static final String CHOICE1_1_3_2 = "Спустится в обход. До заката вы явно не успеете.";

    // 1.1.3.1 Решили спустится напрямую.
    static final String MESSAGE1_1_3_1 = "Вы решаете спуститься напрямую к руинам, сокращая путь и приближаясь к загадочным структурам. Однако, по пути вниз, вы теряете равновесие, и несмотря на ваши попытки удержаться, вы падаете с обрыва, что приводит к смертельным последствиям. Ваше приключение на планете Небесная Эклипса завершается трагически.";

    // 1.1.3.2 Идем в обход.
    static final String MESSAGE1_1_3_2 = "Вы выбираете более долгий путь, вокруг леса, чтобы добраться к руинам. По мере продвижения, солнце начинает садиться, и ночь наступает быстро. Однако, в этот момент начинает происходить что-то удивительное: деревья вокруг вас начинают светиться мягким, фиолетовым светом.\n\nСветящиеся деревья создают волшебную атмосферу в лесу, освещая ваш путь и придавая местности загадочное очарование. Вы оказываетесь окружены этой непередаваемой красотой природы и не замечаете, как к вам незаметно приближается грациозное и загадочное животное. Вы не можете оторвать взгляд от него";
    static final String CHOICE1_1_3_2_1 = "Взять себя в руки и приготовиться к защите"; // Смерть.
    static final String CHOICE1_1_3_2_2 = "Продолжать неподвижно изучать животное";

    // 1.1.3.2.1 Готовимся к атаке животного.
    static final String MESSAGE1_1_3_2_1 = "Вы готовитесь к атаке, поднимая инструмент в руках, но загадочное животное учуяло вашу агрессию и внезапно напало на вас. С его мощными и быстрыми движениями оно преодолело расстояние между вами и внезапно атаковало вас, оставив вас без защиты. Ваше приключение на планете Небесная Эклипса завершилось трагически из-за неудачной встречи с этим мистическим существом.";

    // 1.1.3.2.2 Изучаем животное.
    static final String MESSAGE1_1_3_2_2 = "Вы решаете остаться неподвижными и изучать загадочное существо, не проявляя агрессии. Вас охватывает любопытство и надежда, что это существо не представляет угрозы.\n\nЗагадочное животное, приближаясь к вам, выглядит как длинное и гибкое существо с мягкой, светящейся шерстью, которая меняет цвет от фиолетового к синему, создавая плавные переливы света. У него есть большие глаза с тайной глубиной, и его движения полны грации и элегантности.\n\nЧерез некоторое время существо начинает проявлять интерес к вам и вашей немалой любопытности. Однако, оно не нападает, а вместо этого уходит вглубь леса, исчезая из вашего поля зрения. Возможно, ваша решимость сохранить спокойствие и миролюбие привела к тому, что существо не считает вас угрозой, и вы продолжаете свой путь в сторону руин.";
    static final String CHOICE1_1_3_2_2_1 = "Продолжить путь.";

    // 1.1.3.2.2.1 Продолжаем путь.
    static final String MESSAGE1_1_3_2_2_1 = "Пройдя через светящийся лес и устремившись к руинам, вы наконец выходите к руинам древнего города инопланетян. Город простирается перед вами представляя собой впечатляющий и таинственный пейзаж. Город был построен с учетом необычных архитектурных форм и материалов, которые вы никогда не видели ранее. Окруженный густой растительностью и чудесными светящимися деревьями, город оставляет впечатление невероятной гармонии с окружающей природой.\n\nЗдания города были построены из сверкающих камней, которые, кажется, излучают свет в темноте. Вы видите руины многочисленных башен, пирамид и домов, остатки некогда развитой цивилизации. Здания украшены сложными рельефами и символами, которые остались загадкой для вас.\n\nИсследуя руины древнего города, внезапно обнаруживаете присутствие инопланетянина, стоящего неподалеку. Он является стражем этого удивительного места и наблюдает за вами с вниманием. Его глаза сверкают таинственно, и вам становится интересно, какова его роль и намерения.";

    static final String CHOICE1_1_3_2_2_1_1 = "Подойти к инопланетянину миролюбиво и попытаться наладить контакт.";
    static final String CHOICE1_1_3_2_2_1_2 = "Подойти к инопланетянину с агрессией и попытаться захватить его, надеясь использовать его как залог для получения информации"; // Смерть.

    // 1.1.3.2.2.1.1 Подходим к инопланетянину.
    static final String MESSAGE1_1_3_2_2_1_1 = "Вы решаете подойти к инопланетянину миролюбиво и с интересом, показывая, что вы не представляете угрозу. Он наблюдает за вами, и его глаза сверкают таинственно, но он не проявляет агрессии. Вы начинаете общаться с ним, и инопланетянин отвечает вам на его непонятном языке с использованием жестов и эмоций. Постепенно вы начинаете понимать друг друга и устанавливаете контакт. Он начинает рассказывать историю своей расы";
    static final String CHOICE1_1_3_2_2_1_1_1 = "Слушать историю.";

    // 1.1.3.2.2.1.1.1 Слушаем историю.
    static final String MESSAGE1_1_3_2_2_1_1_1 = "Инопланетянин рассказывает вам, что их цивилизацию и планету Небесная Эклипса однажды навестила ужасная катастрофа. Это было столкновение с огромным астероидом, который пришел с небес и привел к разрушению многих городов и инфраструктуры их планеты. Астероидная ударная волна вызвала стихийные бедствия, изменения климата и нарушение экосистемы.\n\n потеряли множество своих научных и технических знаний в этой катастрофе и были вынуждены уйти в леса, где они пытались выживать и восстанавливать свою цивилизацию с нуля. Теперь им нужна помощь и знания с других миров, чтобы попытаться восстановить то, что они потеряли.";

    static final String CHOICE1_1_3_2_2_1_1_1_1 = "Рассказать инопланетянину правду о вашей миссии и предложить ему помощь";
    static final String CHOICE1_1_3_2_2_1_1_1_2 = "Войти в доверие предложив свою помощь, что бы потом обманом захватить ресурсы."; // Смерть.
    static final String CHOICE1_1_3_2_2_1_1_1_3 = "Уйти от выбора и вернутся к кораблю."; // Смерть.

    // 1.1.3.2.2.1.1.1 Правда.
    static final String MESSAGE1_1_3_2_2_1_1_1_1 = "Вы предлагаете инопланетянам честную помощь в восстановлении их цивилизации и рассказываете им о вашей миссии освоения ресурсов. Инопланетяне, впечатлены вашей честностью и желанием помочь, с радостью соглашаются на сотрудничество.\n\nОни предоставляют вам доступ к своей передовой технологии, которая позволяет вам успешно вернуться на вашу планету. С вашей новой инопланетной технологией вы активируете свой корабль и направляетесь домой, увезя с собой ценные знания и опыт, полученные на планете Небесная Эклипса.\n\nВы завершаете свое приключение, вернувшись домой с ценными ресурсами и новыми друзьями с другой планеты, и сознанием, что честность и взаимопомощь всегда приводят к успеху.";

    // 1.1.3.2.2.1.1.2 Ложь.
    static final String MESSAGE1_1_3_2_2_1_1_1_2 = "Вы решаете втереться в доверие инопланетян и соврать им, скрывая истинную цель вашей миссии. На первый взгляд, они кажутся доверчивыми и принимают вас как союзника.\n\nОднако, со временем инопланетяне раскрывают вашу ложь и понимают, что вы прибыли на их планету с целью эксплуатации ее ресурсов. Их доверие превращается во враждебность, и они объявляют вас врагом. Вас арестовывают и лишают свободы.\n\nВаше приключение на планете Небесная Эклипса заканчивается в плену, и вам больше не удается вернуться домой. Ваши действия влекли к этому трагическому финалу, и вы остаетесь на этой планете, оставшись без шанса вернуться домой.";

    // 1.1.3.2.2.1.1.3 Уйти от выбора.
    static final String MESSAGE1_1_3_2_2_1_1_1_3 = "Вы решаете вернуться к кораблю и попытаться активировать его для возвращения домой, несмотря на опасности на пути. Путь обратно к кораблю оказывается гораздо сложнее и опаснее, чем вы ожидали. Вы сталкиваетесь с многочисленными препятствиями и опасностями, и вам удается их преодолеть только с большими трудностями.\n\nОднако, в самый последний момент, когда вы уже почти достигли корабля, вас нападает смертоносный инопланетный хищник, который с легкостью перехватывает вас. Ваши попытки защититься бесполезны, и вы становитесь жертвой этого смертоносного существа. Ваше приключение на планете Небесная Эклипса заканчивается трагической смертью.";

    // 1.1.3.2.2.1.2 Нападаем на инопланетянина.
    static final String MESSAGE1_1_3_2_2_1_2 = "Вы решаете подойти к инопланетянину с агрессией и попытаться захватить его, надеясь использовать его как залог для получения информации. Однако, инопланетянин оказывается гораздо сильнее и более хитрее, чем вы думали. Он быстро реагирует на вашу агрессию и, с помощью своей передовой технологии, создает энергетический барьер вокруг вас.\n\nЭтот барьер не только лишает вас свободы, но и начинает медленно сжиматься, оставляя вам все меньше и меньше места для движения. Вы чувствуете, как барьер сжимает вас все сильнее, и вскоре он становится настолько плотным, что вам трудно даже дышать. Ваши последние мгновения на планете Небесная Эклипса наполняются ужасом и страхом, прежде чем вы умираете от удушья, запертые в этой смертельной ловушке.";


    // 2. Остаемся на корабле.
    static final String MESSAGE2 = "Вы решаете попробовать активировать корабельные системы. Вы подходите к консоли управления и начинаете проводить диагностику. К сожалению, системы выдают ошибку, и вы не можете установить связь с базой или другими членами экипажа.";
    static final String CHOICE2_1 = "Попытаться найти ресурсы и инструменты, чтобы самостоятельно починить корабль."; // Смерть.
    static final String CHOICE2_2 = "Выйти из корабля и исследовать местность."; // MESSAGE1

    static final String MESSAGE2_1 = "Вы решаете попытаться самостоятельно починить корабль и отправляетесь на поиски необходимых ресурсов и инструментов. После длительного поиска вы обнаруживаете маленький набор инструментов, который, как вам кажется, может пригодиться.\n\nОднако, когда вы возвращаетесь к кораблю и начинаете ремонт, вы неверно подключаете один из энергетических кабелей. Внезапно, мощный разряд энергии пронзает ваше тело, и вы падаете без сознания.\n\nВы не смогли правильно починить корабль и, увы, умираете от поражения электрическим током. Ваше приключение на планете Небесная Эклипса заканчивается здесь.";
}
