package com.example.finaleprojectmodule3.game;

public class TextConstants {
    final String message1 = "Вы просыпаетесь в небольшой каюте своего космического корабля и осознаете, " +
            "что ваше судно повреждено и приземлилось на неизвестной планете. Что вы сделаете?";
    final String choice1_1 = "Попробовать выйти из корабля и исследовать местность в поисках помощи или ресурсов.";
    final String choice1_2 = "Попытаться активировать корабельные системы " +
            "и попробовать связаться с кем-либо из своего экипажа или базой на другой планете.";


    // Остаемся на корабле.
    final String message2_2 = "Вы решаете попробовать активировать корабельные системы. " +
            "Вы подходите к консоли управления и начинаете проводить диагностику. К сожалению, системы выдают ошибку," +
            " и вы не можете установить связь с базой или другими членами экипажа.";
    final String choice2_2_1 = "Попытаться найти ресурсы и инструменты, чтобы самостоятельно починить корабль.";  // смерть.
    final String message2_2_1 = "Вы решаете попытаться самостоятельно починить корабль" +
            " и отправляетесь на поиски необходимых ресурсов и инструментов." +
            " После длительного поиска вы обнаруживаете маленький набор инструментов," +
            " который, как вам кажется, может пригодиться.\n" +
            "\n" +
            "Однако, когда вы возвращаетесь к кораблю и начинаете ремонт, " +
            "вы неверно подключаете один из энергетических кабелей. " +
            "Внезапно, мощный разряд энергии пронзает ваше тело, и вы падаете без сознания.\n" +
            "\n" +
            "Вы не смогли правильно починить корабль и, увы, умираете от поражения электрическим током. " +
            "Ваше приключение на планете Небесная Эклипса заканчивается здесь.";
    final String choice2_2_2 = "Выйти из корабля и исследовать местность в поисках помощи";   // .

    // Выходим исследовать мир.
    final String message2_1 = "Вы решаете выйти из корабля и исследовать местность. " +
            "Поднимаетесь из каюты и открываете дверь корабля.\n" +
            "\n" +
            "Вас окружает удивительный пейзаж: мягкий свет смешивается с нежными оттенками фиолетовых облаков. " +
            "Вы стоите на небольшом холме и видите, что вдали простирается лес, " +
            "состоящий из странных и сверкающих деревьев. Вдалеке виднеются руины очень необычной архитектуры";
    final String choice2_1_1 = "Отправиться в лес и исследовать его, надеясь найти подсказки о починке корабля.";
    final String choice2_1_2 = "Вернуться обратно в корабль, " +
            "чтобы попробовать активировать системы связи или найти другие способы связи с внешним миром.";

}
